content-org/santiyounger-website.org
#+HUGO_BASE_DIR:~/hugo/santiyounger-website
#+hugo_weight: auto
* Trust That What You Know Today Is Good Enough To Start :davincism:creativity:
  :PROPERTIES:
  :EXPORT_HUGO_SECTION: posts
  :EXPORT_FILE_NAME: trust_what_you_know
  :EXPORT_DATE: 2020-08-06
  :END:
  There's an interesting [[#eponymous-200806][Eponymous law]]. called Segal's law, that illustrates how too much information makes us insecure to share our work.
** Segal's Law
   :PROPERTIES:
   :CUSTOM_ID: segals-law-200806
   :END:
 Segal’s Law states:
> “A man with a watch knows what time it is. A man with two watches is never sure.”

 Having too much information can often make a decision more difficult instead of easier.

 This is also related to the paradox of choice, *which overwhelms us and makes us regret any choice we ever make.* since we fall intro the trap of thinking that the alternative choice would have been better.
 
** Share Your Work Improve It As You Go
  If like me you are trying to create meaningful content online. Or if you have a project you've been wanting to share, just do it.

  Publish your work, it doesn't matter how imperfect it seems. The sooner we understand perfection is unachievable the better we'll be.

  Start small, improve as you go, and most of all trust that what you know today is good enough to start.
  
  There's an amazing [[https://sive.rs/infinity][blogpost ]]by [[https://sive.rs][Derek Sivers]] that helps illustrate this point perfectly. 

