content/blog/trust_what_you_know.md
+++
title = "Trust That What You Know Today Is Good Enough To Start"
author = ["santi"]
date = 2020-08-06
tags = ["davincism", "creativity"]
draft = false
weight = 1003
+++

There's an interesting [Eponymous law]({{< relref "eponymous" >}}). called Segal's law, that illustrates how too much information makes us insecure to share our work.


## Segal's Law {#segals-law-200806}

 Segal’s Law states:
> “A man with a watch knows what time it is. A man with two watches is never sure.”

Having too much information can often make a decision more difficult instead of easier.

This is also related to the paradox of choice, **which overwhelms us and makes us regret any choice we ever make.** since we fall intro the trap of thinking that the alternative choice would have been better.


## Share Your Work Improve It As You Go {#share-your-work-improve-it-as-you-go}

If like me you are trying to create meaningful content online. Or if you have a project you've been wanting to share, just do it.

Publish your work, it doesn't matter how imperfect it seems. The sooner we understand perfection is unachievable the better we'll be.

Start small, improve as you go, and most of all trust that what you know today is good enough to start.

There's an amazing [blogpost ](https://sive.rs/infinity)by [Derek Sivers](https://sive.rs) that helps illustrate this point perfectly.
